let expected_location = ("united states");
AuditLogs
| where ActivityDisplayName contains "reset password"
| extend SourceIPAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
| extend userPrincipalName_ = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
| where SourceIPAddress <> ""
| join BehaviorAnalytics on SourceIPAddress
| extend ISP_ = tostring(DevicesInsights.ISP)
| where not (SourceIPLocation has_any (expected_location))
| summarize by UserName,SourceIPAddress,ISP_,SourceIPLocation
