AuditLogs
| extend userPrincipalName_ = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
| where ActivityDisplayName == "Download users - finished (bulk)" or ActivityDisplayName == "Download groups - finished (bulk)"
| distinct TimeGenerated,userPrincipalName_,LoggedByService
