IdentityDirectoryEvents
| extend AttackTechniques_ = tostring(AdditionalFields.AttackTechniques)
| where AttackTechniques_ == "OS Credential Dumping (T1003), DC Sync (T1003.006), NTDS (T1003.003)"
| extend ACTOR_ACCOUNT_ = tostring(AdditionalFields.["ACTOR.ACCOUNT"])
| extend ACTOR_DEVICE_ = tostring(AdditionalFields.["ACTOR.DEVICE"])
| where AdditionalFields.["ACTOR.ACCOUNT"] <> "MSOL_xxxxxxxxx"
| where AdditionalFields.["ACTOR.DEVICE"] <> "ADDS_Server"
| summarize by TimeGenerated,ActionType,DeviceName,DestinationDeviceName,ACTOR_ACCOUNT_,ACTOR_DEVICE_
