DeviceProcessEvents
| where ProcessCommandLine matches regex @'(?i)certutil(\.exe)? -[urlcache|verifyctl] -[f|split]\s(-[f|split])?(\s)?http(s)?://(www\.)?'
| extend isAlternateDatastream = tostring(iff(ProcessCommandLine matches regex @'(?i)\w{1}:\\.*?:.{2,5}','true','false'))
