DeviceProcessEvents
| where ProcessCommandLine has_any ("Set-MpPreference -DisableRealtimeMonitoring","sc stop WinDefend")
| summarize by TimeGenerated,AccountName,DeviceName,FileName,ProcessCommandLine
